[{"model": "reviews.products", "pk": 4, "fields": {"name": "XP", "description": "The Acu XP micro is perfect for those who are serious about relief, but beginners with the technology. It offers the main therapies and just a few extras and still has a dual output for larger or multiple treatment areas.\r\n\r\nIncluded in this package:\r\n– AcuXP Micro device\r\n– 1 set of large single-sided adhesive electrode pads 2 ½ inches (round shape)\r\n– 1 set of small single-sided adhesive electrode pads 1 ¾ inch (small oval shape)\r\n– 2 Electrode Wires\r\n– AC/DC Adapter (travel charger)\r\n– USB Cable\r\n– User Manual", "rating": null, "image": "XP-Micro-Device_Zgwje2d.jpg", "productId": 0}}, {"model": "reviews.products", "pk": 6, "fields": {"name": "Wireless", "description": "Introducing HiDow’s newest multi-stim model, the Pro Touch Wireless 6-12 is a premium electronic muscle stimulator without the hassle of wires.\r\n\r\nNow you can experience Transcutaneous Electrical Nerve Stimulation (TENS) and Electrical Muscle Stimulation (EMS) on the go, during any exercise or workout, all in the comfort of your own space while wearing any clothing comfortably overtop.", "rating": null, "image": "Hidow-Pro-Touch-Device_Wze764Q.jpg", "productId": 0}}, {"model": "reviews.products", "pk": 7, "fields": {"name": "XPDS18", "description": "HiDow’s latest and most advanced model of wired devices for muscle recovery and pain relief, the XPDS 18. Take your EMS experience to the next level with 6 new modes and functions.\r\n\r\nFeatures:\r\n\r\n18 pre-set multi-stim modes (TENS and EMS)\r\ndual port (A and B)\r\nindependent control per port: intensity and modality\r\nself-timer: 10-60 minutes\r\n20 intensity levels\r\nlong-lasting rechargeable lithium battery: 10+ hours of use\r\ncompact, lightweight, and portable", "rating": null, "image": "Hidow-XPDS-18-Device_BZZucGr.jpg", "productId": 0}}, {"model": "reviews.products", "pk": 8, "fields": {"name": "Acubelt", "description": "The belt-style cutaneous garment electrodes are intended to be used with all HiDow electrical stimulating devices. The package includes 2 straps of different lengths that allow you to place the belt-style garment electrodes on various areas. It may be used on the lower back area with the longer strap and legs and arms using the shorter strap. The straps may also be connected to extend the length of the strap if needed.", "rating": null, "image": "Acubelt-addon_dNhA0XR.jpg", "productId": 0}}, {"model": "reviews.products", "pk": 9, "fields": {"name": "Slippers", "description": "The Foot Accessory cutaneous electrodes are intended to be used with all HiDow electrical stimulating devices.\r\n\r\nThe cutaneous Foot Accessory electrodes will deliver the stimulation signals generated by the HiDow stimulator to the bottom of the feet with which they are in contact.\r\n\r\nOne size fits most, not made for walking. Please enjoy while seated.", "rating": null, "image": "HiDow-ACU-Slippers-addon_a3pf16m.jpg", "productId": 0}}, {"model": "reviews.products", "pk": 10, "fields": {"name": "Acuelbow", "description": "The elbow-style cutaneous garment electrodes are intended to be used with all HiDow electrical stimulating devices.\r\n\r\nThe elbow-style cutaneous garment electrodes will deliver the stimulation signals generated by the stimulator to the body surface with which they are in contact. The garment electrodes are made up of conductive silicone rubber.\r\n\r\nUniversal – Works with all HiDow Devices.", "rating": null, "image": "HiDow-AcuElbow-addon_Y3RxBGu.jpg", "productId": 0}}, {"model": "reviews.products", "pk": 11, "fields": {"name": "Acugloves", "description": "The HiDow Glove style accessories are cutaneous electrodes intended to be used with HiDow TENS/EMS stimulating devices.\r\n\r\nThe glove accessory electrodes are non-sterile reusable OTC conductive garments that are intended to deliver the stimulation signals generated by the stimulator to the hands.\r\n\r\nI", "rating": null, "image": "HiDow-AcuGloves-addon_iTJKZ9Q.jpg", "productId": 0}}, {"model": "reviews.products", "pk": 12, "fields": {"name": "XPD12", "description": "The new and improved XPD12 is a powerhouse when it comes to value. 6 pain relief (TENS) and 6 muscle enhancement (EMS) functions make it one of the most popular units in the HiDow lineup.\r\n\r\nFeatures:\r\n– 12 modes (6 TENS, 6 EMS)\r\n– 2 output channels (same modality used on both, differing intensity per output)\r\n– adjustable timer\r\n– backlit LCD display\r\n– built-in rechargeable lithium battery\r\n– 2-year warranty", "rating": null, "image": "XPD12-Device.jpg", "productId": 0}}, {"model": "reviews.products", "pk": 13, "fields": {"name": "Acuwrist", "description": "The wrist-style cutaneous garment electrodes are intended to be used with all HiDow electrical stimulating devices.\r\n\r\nThe wrist-style cutaneous garment electrodes will deliver the stimulation signals generated by the stimulator to the body surface with which they are in contact. The garment electrodes are made up of conductive silicone rubber.\r\n\r\nUniversal – Works with all HiDow Devices.", "rating": null, "image": "HiDow-AcuWrist-addon_gGVObEO.jpg", "productId": 0}}, {"model": "reviews.products", "pk": 14, "fields": {"name": "Acuneck", "description": "The neck style cutaneous garment electrodes are intended to be used with HiDow electrical stimulating devices.\r\n\r\nThe neck style cutaneous garment electrodes will deliver the stimulation signals generated by the stimulator to the body surface with which they are in contact. The garment electrodes are made up of conductive silicone rubber.", "rating": null, "image": "HiDow-Neck-Wrap-addon_34Mv9Wd.jpg", "productId": 0}}, {"model": "reviews.products", "pk": 15, "fields": {"name": "Lifetime Warranty Card", "description": "All genuine HiDow TENS and EMS units come with a 2-year warranty that covers manufacturer defects.\r\nThis VIP membership entitles the bearer to the following benefits:\r\n-Lifetime warranty service for your HiDow device*\r\n-Exclusive email offers and promotions\r\n-20% off all orders at www.hidow.com", "rating": null, "image": "Lifetime-Warranty_VACTvkx.jpg", "productId": 0}}, {"model": "reviews.review", "pk": 22, "fields": {"author": "Billi ", "review_date": "2022-07-13T05:35:03.537Z", "stars": 5, "comment": "bbbbbb", "product": 4}}]